{
    "nasa-tbl-orb": "Curiosity Heads for Mount Sharp\n\nIn July 2013, Curiosity began its long journey to the base of Mt Sharp, seen in the distance in this image. Because it is operated robotically, it only travels a few meters every hour and communicates with its Earth technicians after each step. Because radio waves take 20 minutes or longer to reach earth, 40 minutes elapse before a transmitted command is received and the results of the action can be verified.\n\nThe table below gives the progress made by Curiosity during several days of operation\non Mars, called Sols.\n\nSol,Drive,Duration (minutes),Odometer (meters),Azimuth (degrees),Pitch (degrees)\n345,68,83,1490,235,-1\n347,69,67,1550,236,-2\n349,70,72,1621,190,+1\n351,71,94,1706,249,+1\n354,72,65,1763,304,+1",
    "nasa-flare-tbl": "Solar Flares\n\nThere is an image that was taken by NASA's Solar Dynamics Observatory on July 6, 2012 and it shows a brilliant X-ray solar flare erupting from the sun. \n\nSolar flares are not all the same. Some produce less energy than others, and so astronomers classify them by their X-ray energy using four different letters: B, C, M and X. C-class flares produce 10 times more X-ray energy than Bclass flares. M-class flares produce 10 times more energy than C-class flares, and X-class flares produce 10 times more energy than M-class flares. One B-class flare can produce more energy than 240,000 million tons of TNT!\n\nThe table below lists all of the M and X-class flares detected between January 1, 2013 and August 15, 2013 at a time when solar activity was near its maximum. This period of time spans the first 227 days of 2013. Also during this time, there were about 690 C-class flares and 440 B-class flares. All of these flares were seen on the side of the sun facing Earth, which represents ½ of the total surface area of the sun.\n\nDay,Flare,Day,Flare,Day,Flare\n1-5,M,5-2,M,5-20,M\n1-11,\"M, M\",5-3,\"M, M\",5-22,M\n1-13,\"M, M\",5-5,M,5-31,M\n2-17,M,5-10,M,6-5,M\n3-5,M,5-12,\"M, M\",6-7,M\n3-15,M,5-13,\"X, M, X\",6-21,M\n3-21,M,5-14,X,6-23,M\n4-5,M,5-15,X,7-3,M\n4-11,M,5-16,M,8-12,M\n4-22,M,5-17,M,,",
    "vector-roof-solar": "A Practical Application of Vector Dot and Cross Products\n\nRoof-corner coordinates (m): P1(6, 8, 4), P2(21, 8, 4), P3(21, 16, 10), P4(6, 16, 10).  Edge vectors A = P2 - P1, B = P4 - P1.  Unit-sun vector S = ½ x - 6/7 y + 1/7 z; solar-flux vector F = 910 S (W m⁻²).",
    "cloud-mass": "Estimating the Mass of a Cloud\n\nBrilliant white cumulus clouds have densities of about 0.3 g m⁻³.  Mass = Density x Volume.  A typical small cumulus cloud can be approximated as a sphere of diameter 3.0 km.",
    "rainfall-rates": "Working with Rainfall Rates and Water Volume\n\nRain-rate classifications:\nType of Storm,Rate\nLight Rain,2 - 4 mm h⁻¹\nModerate,5 - 9 mm h⁻¹\nHeavy,10 - 40 mm h⁻¹\nViolent,> 50 mm h⁻¹.\nConversions: 1 inch = 25 mm; 1 mm rain on 1 m² = 1 L water.",
    "naep-read-fish": "The Fish by Elizabeth Bishop\n\nI caught a tremendous fish\nand held him beside the boat\nhalf out of water, with my hook\nfast in a corner of his mouth.\n5\nHe didn't fight.\nHe hadn't fought at all.\nHe hung a grunting weight,\nbattered and venerable\nand homely. Here and there\n10\nhis brown skin hung in strips\nlike ancient wallpaper,\nand its pattern of darker brown\nwas like wallpaper:\nshapes like full-blown roses\n15\nstained and lost through age.\nHe was speckled with barnacles,\nfine rosettes of lime,\nand infested\nwith tiny white sea-lice,\n20\nand underneath two or three\nrags of green weed hung down.\nWhile his gills were breathing in\nthe terrible oxygen\n—the frightening gills,\n25\nfresh and crisp with blood,\nthat can cut so badly—\nI thought of the coarse white flesh\npacked in like feathers,\nthe big bones and the little bones,\n30\nthe dramatic reds and blacks\nof his shiny entrails,\nand the pink swim-bladder\nlike a big peony.\nI looked into his eyes\n35\nwhich were far larger than mine\nbut shallower, and yellowed,\nthe irises backed and packed\nwith tarnished tinfoil\nseen through the lenses\n40\nof old scratched isinglass.\nThey shifted a little, but not\nto return my stare.\n—It was more like the tipping\nof an object toward the light.\n45\nI admired his sullen face,\nthe mechanism of his jaw,\nand then I saw\nthat from his lower lip\n—if you could call it a lip—\n50\ngrim, wet, and weaponlike,\nhung five old pieces of fish-line,\nor four and a wire leader\nwith the swivel still attached,\nwith all their five big hooks\n55\ngrown firmly in his mouth.\nA green line, frayed at the end\nwhere he broke it, two heavier lines,\nand a fine black thread\nstill crimped from the strain and snap\n60\nwhen it broke and he got away.\nLike medals with their ribbons\nfrayed and wavering,\na five-haired beard of wisdom\ntrailing from his aching jaw.\n65\nI stared and stared\nand victory filled up\nthe little rented boat,\nfrom the pool of bilge\nwhere oil had spread a rainbow\n70\naround the rusted engine\nto the bailer rusted orange,\nthe sun-cracked thwarts,\nthe oarlocks on their strings,\nthe gunnels—until everything\n75\nwas rainbow, rainbow, rainbow!\nAnd I let the fish go.\n\n\"The Fish\" from THE COMPLETE POEMS 1927-1979 by Elizabeth Bishop. Copyright (c) 1979, 1983 by Alice Helen Methfessel. Used by permission of Farrar, Straus and Giroux, LLC. All rights reserved.\n",
    "naep-read-fun": "FUN by Suzanne Britt Jordan (8R4 - 8 questions)\nSomewhere along the line people got the modern idea that fun was there for the asking, that people deserved fun, that if we didn't have a little fun every day we would turn into (sakes alive!) puritans.\n\n\"Was it fun?\" became the question that overshadowed all other questions: good questions like: Was it moral? Was it kind? Was it honest? Was it beneficial? Was it generous? Was it necessary? And (my favorite) was it selfless?\n\nWhen the pleasure got to be the main thing, the fun fetish was sure to follow. Everything was supposed to be fun. If it wasn't fun, then we were going to make it fun, or else.\n\nThink of all the things that got the reputation of being fun. Family outings were supposed to be fun. Education was supposed to be fun. Work was supposed to be fun. Walt Disney was supposed to be fun. Church was supposed to be fun. Staying fit was supposed to be fun.\n\nJust to make sure that everybody knew how much fun we were having, we put happy faces on flunking test papers, dirty bumpers, sticky refrigerator doors, bathroom mirrors.\n\nIf a kid, looking at his very happy parents traipsing through that very happy Disney World, said, \"This ain't fun, ma,\" his ma's heart sank. She wondered where she had gone wrong. Everybody told her what fun family outings to Disney World would be. Golly gee, what was the matter?\n\nFun got to be such a big thing that everybody started to look for more and more thrilling ways to supply it. One way was to step up the level of danger so that you could be sure that, no matter what, you would manage to have a little fun.\n\nTelevision commercials brought a lot of fun and fun-loving folks into the picture. Everything that people in those commercials did looked like fun: taking Polaroid snapshots, buying insurance, mopping the floor, bowling, taking aspirin. The more commercials people watched, the more they wondered when the fun would start in their own lives. It was pretty depressing.\n \nBig occasions were supposed to be fun. Christmas, Thanksgiving and Easter were obviously supposed to be fun. Your wedding day was supposed to be fun. Your honeymoon was supposed to be the epitome of fundom. And so we ended up going through every Big Event we ever celebrated, waiting for the fun to start.\n\nIt occurred to me, while I was sitting around waiting for the fun to start, that not much is, and that I should tell you just in case you're worried about your fun capacity.\n\nI don't mean to put a damper on things. I just mean we ought to treat fun reverently. It is a mystery. It cannot be caught like a virus. It cannot be trapped like an animal. The god of mirth is paying us back for all those years of thinking fun was everywhere by refusing to come to our party. I don't want to blaspheme fun anymore. When fun comes in on little dancing feet, you probably won't be expecting it. In fact, I bet it comes when you're doing your duty, your job, or your work. It may even come on a Tuesday.\n\nI remember one day, long ago, on which I had an especially good time. Pam Davis and I walked to the College Village drug store one Saturday morning to buy some candy. We were about 12 years old. She got her Bit-O-Honey. I got my malted milk balls, chocolate stars, Chunkys, and a small bag of M & M's. We started back to her house. I was going to spend the night. We had the whole day to look forward to. We had plenty of candy. It was a long way to Pam's house but every time we got weary Pam would put her hand over her eyes, scan the horizon like a sailor and say, \"Oughta reach home by nightfall,\" at which point the two of us would laugh until we thought we couldn't stand it another minute. Then after we got calm, she'd say it again. You should have been there. It was the kind of day and friendship and occasion that made me deeply regretful that I had to grow up.\n\nIt was fun.\n\nFrom The New York Times, December 13,\n1979, copyright © 1979 by The New York\nTimes. Used by permission.", 
    "naep-read-meters": "Kid Fights Cheater Meters and Wins! (8R8 - 12 questions)\nThe true story of a girl with a stopwatch and a bag of nickels who uncovered a local parking scandal and helped change the laws of her state . . .\n\nEllie Lammer wasn't trying to spark a revolt, she just wanted a haircut. That was in the fall of 1997. Ellie was 11 years old at the time, and she was getting her tresses trimmed in her hometown of Berkeley, California. When Ellie and her mom returned to their car, they found a parking ticket stuck to the windshield. It didn't seem possible: Less than an hour earlier, Ellie had pumped an hour's worth of coins into the meter. But now the needle was at zero, and Ellie's mom owed $20.\n\nFeeling cheated, Ellie dropped another nickel in the meter and twisted the knob. The needle clicked over to the four-minute mark. Ellie stared at her watch while her mom watched the meter. Less than three minutes later, all of the time had expired. There it was: proof that they'd been cheated. The city tore up the ticket when Ellie's mom complained about the meter.\n\nBut the experience left Ellie wondering how many other meters were inaccurate. Six months later, she decided to find out. She'd been looking around for a good science-fair project—and that meter in Berkeley still bothered her. So armed with a bag of nickels and a stopwatch, she hit the streets.\n\nEllie didn't have the time or money to test every meter, so she focused on a sample of 50 meters located in different parts of the city. To avoid inconveniencing motorists, she did her research after 6 P.M. and on Sundays, when the meters were not in use. She put in eight minutes' worth of nickels in each meter, then measured how much time it really gave.\n\nThe results were not pretty. Ellie's findings suggested that more than nine out of every ten meters in the city were inaccurate—and that every fourth parking meter was running out of time too quickly. With 3,600 parking meters in the city, that meant a lot of undeserved tickets. As Ellie wrote in her science-project report, \"I learned which meters cheat you and which meters cheat the City of Berkeley. But I learned that almost all meters cheat someone, so beware.\"\n\nWhen the science fair rolled around, Ellie presented her findings with computer-generated charts and graphs. Her classmates weren't very interested in her project. \"It's not like they have to drive a car or put money in a parking meter,\" she explains. But her project was a huge hit with parents. More than 50 of them lined up that night to share their own parking-meter horror stories with Ellie.\n\nAfter that, word about Ellie's meter project spread fast. Within a few weeks, Ellie got a call from local politician Diane Woolley. At the time, Berkeley was considering replacing its meters with more accurate digital ones. Ellie shared her findings at city hall, and the politicians were impressed. \"We don't get reports this thorough when we pay consultants hundreds of thousands of dollars,\" one remarked. Based on Ellie's study, they decided to purchase 2,000 new meters.\n\nThe California state legislature also decided to crack down on cheater meters. After Ellie presented her findings, they enacted \"Lammer's Law,\" which requires California's 26 counties to test the accuracy of parking meters. Any meter found to be inaccurate must be fixed or dismantled.\n\nCalifornia Governor Pete Wilson signed the law on November 1, 1998. At the time, he commented, \"Ellie's ingenuity and dedication has earned her the gratitude of those Californians who've dug through their purses and pockets in search of exact change to feed the meters, only to return to find their cars bearing the dreaded green envelope of a parking ticket.\"\n\nEllie became a celebrity. She was in newspapers all over the country and featured on local television news during the summer and fall of 1998. CNN did a story about her. She was even a guest on the Late Show with David Letterman. \"It was kind of a weird moment of being a celebrity,\" she says.\n\nEllie, who's now an eighth-grader at Martin Luther King Middle School, is proud of the work she's done. But she doesn't see meter monitoring as her life's work: \"Right now I don't mind being known as the parking-meter girl, but I'm sure that later in life I'll want something different.\"\n\n© 2000 by Consumers Union of U.S., Inc. Yonkers, NY 10703-1057, a nonprofit organization.  Reprinted with permission from ZILLIONS ® for educational purposes only.  No commercial use or photocopying permitted.",
    "naep-read-shark": "Little Great White by Pamela S. Turner\nMoms, dads, and kids crowded around the window at Monterey Bay Aquarium. When a small gray-and-white shark swam by, a woman squealed, \"There she is!\"\nEight-year-old Sammy gazed up at the shark. He saw the rows of perfectly white, perfectly sharp teeth. \"She's really pretty,\" said Sammy, \"but a little scary, too.\"\nThe shark was a baby \"great white shark.\" (Scientists call them white sharks.) They have a terrifying reputation: Sometimes the sharks attack swimmers, probably because the shark mistakes the swimmer for a seal or sea lion. Attacks on humans are rare. But many movies make people think that these sharks are monsters waiting to eat them.\nThe baby white shark at Monterey Bay Aquarium wasn't much of a monster. At 4 feet 4 inches long and 62 pounds, she was about the same size as a nine-year-old girl. But when full-grown, she could reach 19 feet in length and weigh more than 2 tons-longer and heavier than a minivan.\n\"We are really quite proud of her,\" said John O'Sullivan of the Monterey Bay Aquarium. \"She is a beautiful, fascinating, majestic swimmer.\"\nCan We Keep Her?\nBringing a white shark to the aquarium wasn't easy. For fifty years aquariums have tried to keep white sharks alive, but the sharks would not eat in captivity.\nThe baby shark had been caught accidentally by a halibut fisherman off the coast of Southern California. Mr. O'Sullivan and his team knew that white sharks were sometimes caught this way. The aquarium had a special floating pen waiting in coastal waters nearby. While the shark lived in the pen, she was fed the same things she would have eaten in the wild-smaller sharks and other fish. The floating pen helped her get used to living in a small space.\nAfter living in the pen for 26 days, the shark was put into a special 3,000-gallon tank and driven north to the aquarium. She was given a quick health check and slipped into the million-gallon Outer Bay Exhibit tank. The next morning, the shark ate salmon for breakfast. The aquarium staff cheered!\nPage 2\nThe baby shark was fed using a long pole with a loop at the end to hold pieces of fish. \"You slap the food in front of her, get her excited, and she attacks it,\" explained Mr. O'Sullivan. \"When you watch her feed, it is very, very exciting.\" At one point, she bit the feeding stick and snapped off a piece of it.\nA Healthy Appetite\nThe aquarium staff worried that the white shark might attack her tankmates, such as tuna, sea turtles, stingrays, and soupfin sharks. \"We try to make sure everybody in the tank is happy and has a full tummy,\" said Mr. O'Sullivan. \"A few of the little barracuda\nnip at her tail. It is sort of like a dog chasing a car. It is probably not a smart thing to do!\"\nThe aquarium staff didn't know how long they could keep the baby white shark. They planned to set her free if she stopped eating. Even if they could keep her a long time, they planned to set her free when she got bigger.\nIn just six and a half months, the shark grew two feet in length and more than doubled in weight. Scientists were surprised at how quickly she grew.\nAs the white shark got bigger, she began hunting her tankmates. She bit and killed two soupfin sharks. The aquarium released her into the ocean on March 31, 2005.\nPage 3\nA Message Home\nBefore letting her go, scientists attached a special \"pop-up\" satellite tag to the white shark. A month later the tag automatically popped off the shark, floated to the surface, and sent data to an orbiting satellite.\nThe tag told scientists that the shark was alive and had swum 200 miles south since her release. This is as close as any shark gets to sending a postcard: \"The water is fine. Wish you were here!\"\nDuring her stay, the baby shark gave people a more balanced view of white sharks. People fear many animals, such as lions and grizzly bears. But over time, people have accepted the idea that these animals have a right to exist. We set up national parks to protect them.\nMany scientists think that white sharks are very rare and should also be protected. It is now against the law to fish for white sharks off the shores of places like the United States, Australia, and South Africa.\n\"Having a live, swimming white shark lets people say, 'Wow, this animal is really neat,'\" says Mr. O'Sullivan. He hopes that people will begin to understand this magnificent creature. Then they will help protect it.\nCopyright © 2006 by Highlights for Children, Inc., Columbus, Ohio. Photos: © Monterey Bay Aquarium.\nPage 4\n",
    "naep-read-alligator": "Alligator Poem (8R10 - 4 questions)\nby Mary Oliver\n\nI knelt down\nat the edge of the water,\nand if the white birds standing\nin the tops of the trees whistled any warning\nI didn't understand,\nI drank up to the very moment it came\ncrashing toward me,\nits tail flailing\nlike a bundle of swords,\nslashing the grass,\nand the inside of its cradle-shaped mouth\ngaping,\nand rimmed with teeth—\nand that's how I almost died\nof foolishness\nin beautiful Florida.\nBut I didn't.\nI leaped aside, and fell,\nand it streamed past me, crushing everything in its path\nas it swept down to the water\nand threw itself in,\nand, in the end,\nthis isn't a poem about foolishness\nbut about how I rose from the ground\nand saw the world as if for the second time,\nthe way it really is.\nThe water, that circle of shattered glass,\nhealed itself with a slow whisper\nand lay back\nwith the back-lit light of polished steel,\nand the birds, in the endless waterfalls of the trees,\nshook open the snowy pleats of their wings, and drifted away\nwhile, for a keepsake, and to steady myself,\nI reached out,\nI picked the wild flowers from the grass around me—\nblue stars\nand blood-red trumpets\non long green stems—\nfor hours in my trembling hands they glittered\nlike fire.\n\nFrom New and Selected Poems: Volume One by Mary Oliver. Copyright © 1992 by Mary Oliver. Reprinted by permission of Beacon Press, Boston"
}